Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: my $name = $c->param('name') || '';
ja: my $name = $self->param('name') || '';

source: my $size = length $c->req->body;
ja: my $size = length $self->req->body;

source: my $ua = $c->req->headers->user_agent;
ja: my $ua = $self->req->headers->user_agent;

source: my $user = $c->param('user');
ja: my $user = $self->param('user');

source: my $user = $c->whois;
ja: my $user = $self->whois;

source: my ($c, $hash) = @_;
ja: my ($self, $hash) = @_;

source: return $c->redirect_to('form') unless my $example = $c->param('example');
ja: return $self->redirect_to('form')unless my $example = $self->param('example');

source: return $c->render(json => {hello => 'world'})
ja: return $self->render(json => {hello => 'world'})

source: return $c->render(text => 'File is too big.', status => 200)
ja: return $self->render(text => 'File is too big.', status => 200)

source: return 1 if $c->req->headers->header('X-Awesome');
ja: return 1 if $self->req->heaers->header('X-Awesome');

source: return 1 if $c->req->headers->header('X-Bender');
ja: return 1 if $self->req->headers->header('X-Bender');
